SylvainMontagny/STM32WL/STM32WL-standalone/LoRaWAN/App/lora_app.c
		UTIL_TIMER_Create(&TxLedTimer, 0xFFFFFFFFU, UTIL_TIMER_ONESHOT, OnTxTimerLedEvent, NULL);
		UTIL_TIMER_Create(&RxLedTimer, 0xFFFFFFFFU, UTIL_TIMER_ONESHOT, OnRxTimerLedEvent, NULL);
		UTIL_TIMER_Create(&JoinLedTimer, 0xFFFFFFFFU, UTIL_TIMER_PERIODIC, OnJoinTimerLedEvent, NULL);
		UTIL_TIMER_SetPeriod(&TxLedTimer, 500);
		UTIL_TIMER_SetPeriod(&RxLedTimer, 500);
		UTIL_TIMER_SetPeriod(&JoinLedTimer, 1000);

		UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_LmHandlerProcess), UTIL_SEQ_RFU, LmHandlerProcess);
		UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_LoRaSendOnTxTimerOrButtonEvent), UTIL_SEQ_RFU, SendTxData);

		LoraInfo_Init();

		/* Initialize all callbacks */
		LmHandlerInit(&LmHandlerCallbacks);

		/* Print LoRaWAN information : DevEUI & Devaddr when ABP - DevEUI & AppEUI-JoinEUI for OTAA */
		/* Print Session Keys for ABP - Print Root Key for OTAA :LmHandlerConfigure() > LoRaMacInitialization() > SecureElementInit() > PrintKey() */
		LmHandlerConfigure(&LmHandlerParams);

		/* Let all print out terminated. Otherwise logs are affected.*/
		HAL_Delay(500);

		/* Join Red LED starts blinking */
		UTIL_TIMER_Start(&JoinLedTimer);

		/* Join procedure for OTAA */
		/* First try to Join Network. Next time the Device tries to send data (LmHandlerSend), it will check the Join.
		 * If the first Join was NOT successful, it sends another Join.
		 */
		LmHandlerJoin(ActivationType);
	}

}


// Callback for byte reception
static void byteReception(uint8_t *PData, uint16_t Size, uint8_t Error){
	static uint32_t index = 0;

	USART2->TDR = *PData;

	if ( *PData == '\r' ){
		rxBuff[index] = '\0';

		if ( strcmp(rxBuff , "t") == 0){

			APP_LOG_COLOR(GREEN);
			APP_LOG(0, 1, "\tTransmition required by the user\r\n");
			UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_LoRaSendOnTxTimerOrButtonEvent), CFG_SEQ_Prio_0);
			if (SEND_BY_PUSH_BUTTON == false){
				UTIL_TIMER_Start(&TxTimer);
			}
		}
		else if ( strcmp(rxBuff , "r") == 0){
			APP_LOG_COLOR(GREEN);
			APP_LOG(0, 1, "\tThe Device is resetting...\r\n");
			NVIC_SystemReset();
		}
		else if ( strcmp(rxBuff , "help") == 0 || strcmp(rxBuff , "h") == 0){
			APP_LOG_COLOR(BLUE);
			APP_LOG(0, 1, "\t- t \t\t transmission of a new LoRaWAN packet\r\n");
			APP_LOG(0, 1, "\t- r \t\t Reset End-Device\r\n");
			APP_LOG(0, 1, "\t- h \t\t Help\r\n");
			APP_LOG(0, 1, "\t- lora \t\t Enter Raw LoRa Packet mode\r\n");
		}

		else if ( strcmp(rxBuff , "lora") == 0 ){
			if( LoRaMode == 0 ){
				LoRaMode = 1;
				UTIL_TIMER_Stop(&TxTimer);
				BSP_PB_DeInit(BUTTON_SW1);
				APP_LOG_COLOR(RED);
				APP_LOG(0, 1, "\tLoRaWAN application stops\r\n");
				APP_LOG_COLOR(BLUE);
				APP_LOG(0, 1, "\r\n\r\nRaw LoRa Packet Application\r\n\r\n");
				APP_LOG_COLOR(WHITE);
				APP_LOG(0, 1, "\r\nType the following command to send a Raw LoRa Packet\r\n");
				APP_LOG(0, 1, "> Command format : LORA=Frequency:Power:SF:Payload\r\n");
				APP_LOG(0, 1, "> Example :        LORA=868100000:14:7:01020304 \r\n");
			}
			else{
				APP_LOG_COLOR(RED);
				APP_LOG(0, 1, "\r\n - You already entered the Raw LoRa Packet mode\r\n - To send a LoRa command please use this format: LORA=Frequency:Power:SF:Payload\r\n");
			}
		}
		else if(isTriggered == 1)
		{
			PrepareLoRaFrame("ERROR");
			isTriggered = 0;
			index = 0;
		}
		else if (LoRaMode == 1){
			PrepareLoRaFrame(rxBuff);
		}

		else{
			APP_LOG_COLOR(GREEN);
			APP_LOG(0, 1, "\tUnknown command\r\n");
		}
		index = 0;
	}
	else{
		rxBuff[index++] = *PData;
		if ( index == RX_BUFF_SIZE ){
			isTriggered = 1;
			index = 0;
		}
	}
	APP_LOG_COLOR(RESET_COLOR);
}


void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
	switch (GPIO_Pin)
	{
	case  BUTTON_SW1_PIN:
		UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_LoRaSendOnTxTimerOrButtonEvent), CFG_SEQ_Prio_0);
		break;
	case  BUTTON_SW2_PIN:
		break;
	case  BUTTON_SW3_PIN:
		break;
	default:
		break;
	}
}

static void SendTxData(void)
{
	UTIL_TIMER_Time_t nextTxIn = 0;
	uint32_t i = 0;
	uint8_t channel = 0;

	EnvSensors_Read(&sensor_data);
	sensor_data.stm32wl_temperature = (SYS_GetTemperatureLevel() >> 8);
	sensor_data.temperature_simulated = simuTemperature();
	sensor_data.humidity_simulated = simuHumidity();
	sensor_data.atim_thaq = simuAtim();
	sensor_data.watteco_tempo = simuWatteco();
	sensor_data.tct_egreen = simuTct();

	if (WATTECO_TEMPO) AppData.Port = WATTECO_TEMPO_PORT;
	else AppData.Port = APP_PORT;

	if(PAYLOAD_1234){
		AppData.Buffer[i++] = 0x01;
		AppData.Buffer[i++] = 0x02;
		AppData.Buffer[i++] = 0x03;
		AppData.Buffer[i++] = 0x04;
//		AppData.Buffer[i++] = 'H';
//		AppData.Buffer[i++] = 'E';
//		AppData.Buffer[i++] = 'L';
//		AppData.Buffer[i++] = 'L';
//		AppData.Buffer[i++] = 'O';
		AppData.BufferSize = i;
	}
	else if(!CAYENNE_LPP){
		if(PAYLOAD_TEMPERATURE){
			if(SENSOR_ENABLED){
				AppData.Buffer[i++] = sensor_data.stts751_temperature_int8;
			}
			else{
				AppData.Buffer[i++] = sensor_data.temperature_simulated;
			}
		}
		if(PAYLOAD_HUMIDITY){
			if(SENSOR_ENABLED){
				AppData.Buffer[i++] = sensor_data.hts221_humidity_int8;
			}
			else{
				AppData.Buffer[i++] = sensor_data.humidity_simulated;
			}
		}
		if(USMB_VALVE){
			AppData.Buffer[i++] = sensor_data.setpoint;
			AppData.Buffer[i++] = sensor_data.temperature_simulated;
		}
		else if(ATIM_THAQ){
			/* Fill the buffer with each useful bytes */
			AppData.Buffer[i++] = sensor_data.atim_thaq.header1;
			AppData.Buffer[i++] = sensor_data.atim_thaq.header2;
			AppData.Buffer[i++] = sensor_data.atim_thaq.header3;
			AppData.Buffer[i++] = sensor_data.atim_thaq.header4;
			AppData.Buffer[i++] = sensor_data.atim_thaq.sensor_status>>8;
			AppData.Buffer[i++] = sensor_data.atim_thaq.sensor_status;
			AppData.Buffer[i++] = sensor_data.atim_thaq.temperature>>8;
			AppData.Buffer[i++] = sensor_data.atim_thaq.temperature;
			AppData.Buffer[i++] = sensor_data.atim_thaq.humidity>>8;
			AppData.Buffer[i++] = sensor_data.atim_thaq.humidity;
			AppData.Buffer[i++] = sensor_data.atim_thaq.air_quality>>8;
			AppData.Buffer[i++] = sensor_data.atim_thaq.air_quality;
			AppData.Buffer[i++] = sensor_data.atim_thaq.end1;
			AppData.Buffer[i++] = sensor_data.atim_thaq.end2;
			AppData.Buffer[i++] = sensor_data.atim_thaq.end3;
			AppData.Buffer[i++] = sensor_data.atim_thaq.end4;
			AppData.Buffer[i++] = sensor_data.atim_thaq.end5;
		}
		else if(WATTECO_TEMPO){
			/* Fill the buffer with each useful bytes */
			for (uint16_t w_index = 0/* Watteco index to build the frame */; w_index < 256; w_index += 8){
				AppData.Buffer[i++] = sensor_data.watteco_tempo.data[w_index/64]>>(56-(w_index%64));
			}
		} 
		else if(TCT_EGREEN){
			/* Fill the buffer with each useful bytes */
			AppData.Buffer[i++] = sensor_data.tct_egreen.type;
			AppData.Buffer[i++] = sensor_data.tct_egreen.data_type1;
			AppData.Buffer[i++] = sensor_data.tct_egreen.temperature>>8;
			AppData.Buffer[i++] = sensor_data.tct_egreen.temperature;
			AppData.Buffer[i++] = sensor_data.tct_egreen.data_type2;
			AppData.Buffer[i++] = sensor_data.tct_egreen.courant>>8;
			AppData.Buffer[i++] = sensor_data.tct_egreen.courant;
			AppData.Buffer[i++] = sensor_data.tct_egreen.data_type3;
			AppData.Buffer[i++] = sensor_data.tct_egreen.voltage>>8;
			AppData.Buffer[i++] = sensor_data.tct_egreen.voltage;
		}
		AppData.BufferSize = i;
	}
	else{	// CAYENNE
		CayenneLppReset();
		if(PAYLOAD_TEMPERATURE){
			if(SENSOR_ENABLED){
				CayenneLppAddTemperature(channel++, (int16_t)(sensor_data.hts221_temperature_float));
			}
			else{
				CayenneLppAddTemperature(channel++, sensor_data.temperature_simulated);
			}
		}

		if(PAYLOAD_HUMIDITY){
			if(SENSOR_ENABLED){
				CayenneLppAddRelativeHumidity(channel++, (int16_t)(sensor_data.hts221_humidity_float));
			}
			else{
				CayenneLppAddRelativeHumidity(channel++, (uint16_t)(sensor_data.humidity_simulated));
			}
		}
		CayenneLppCopy(AppData.Buffer);
		AppData.BufferSize = CayenneLppGetSize();
	}


	if (LORAMAC_HANDLER_SUCCESS == LmHandlerSend(&AppData, LORAWAN_DEFAULT_CONFIRMED_MSG_STATE, &nextTxIn, false))
	{
		/* This is written with TimeStamp ON > See function timeStampNow in sys_app.c */
		//APP_LOG(TS_ON, VLEVEL_L, " Packet transmitted\r\n");
	}
	else if (nextTxIn > 0)
	{
		APP_LOG(TS_ON, VLEVEL_L, "Next Tx in  : ~%d second(s)\r\n", (nextTxIn / 1000));
	}
}

uint8_t simuTemperature(void){
	static uint8_t temp=20, countUP = 0;
	static int8_t temp_valve = 40; // temp in Q7.1, so 40 = 20°C
	float error = 0;

