SylvainMontagny/STM32WL/STM32WL-standalone/LoRaWAN/App/lora_app.c
	if(USMB_VALVE){
		/* Case thermostatic valve simulated.
		 * Temperature sould reach the setpoint given by the user by adding at each function call
		 * half of the difference between the actual temperature and the setpoint.
		 * Variables are in Q7.1, so 41 = 20.5°C, from -128 to 127 => -64°C to 63.5°C*/
		error = ((float) (sensor_data.setpoint - temp_valve))/2;

		if (abs(error)<1.0 && error != 0){					// Correct the error rounding
			if (sensor_data.setpoint > temp_valve) error = 1.0;
			else error = -1.0;
		}

		temp_valve += error;
		return temp_valve;
	}
	else{
		if ( (temp == 20) || (temp == 25)){
			countUP = (countUP + 1)%2;
		}

		temp = (countUP == 1)? temp + 1 : temp - 1;
		return temp;
	}
}

uint8_t simuHumidity(void){
	static uint8_t humid = 50, countUP = 0;

	if ( (humid == 50) || (humid == 60)){
		countUP = (countUP + 1)%2;
	}

	humid = (countUP == 1)? humid + 1 : humid - 1;
	return humid;
}

/**
 * ATIM TAHQ simulated function payload 
 * @return atim payload with changing temperature
 */
atim_payload_t simuAtim(void){
	static atim_payload_t payload = {0xE0, 0x67, 0xB8, 0x3C, 0x0D08, 0x07C7, 0x0912, 0xC20C, 0x00, 0x84, 0x0D, 0x05, 0x18}; /* Random real atim_thaq payload */
	static uint8_t countUP = 0;

	payload.temperature = (countUP==0)? 0x07C7: 0x07FA; /* Temperature in centidegree cC */
	countUP = (countUP + 1) % 2;

	return payload;
}

/**
 * TCT EGREEN simulated function payload 
 * @return tct payload with changing courant and voltage
 */
tct_payload_t simuTct(void){
	static tct_payload_t payload = {0xa0, 0x08, 0x088f, 0x0b, 0x0071, 0x0a, 0x11bf};
	static uint8_t countUP = 0;

	// Let's have a constant power P = UI
	payload.courant = (countUP==0)? 0x0071: 0x006b; /* Courant in centiampere cA */
	payload.voltage = (countUP==0)? 0x11bf: 0x12be; /* Voltage in mV */
	countUP = (countUP + 1) % 2;

	return payload;
}

/**
 * Watteco temp'o simulated function payload 
 * @return fixed payload
 */
watteco_payload_t simuWatteco(void){
	return (watteco_payload_t) {0x2205805533c90160, 0xb49f200903084056, 0x00b202901580ac00, 0x6491aa4e954aa512};
}

static void OnTxData(LmHandlerTxParams_t *params)
{
	if ((params != NULL))
	{
		/* Process Tx event only if its a mcps response to prevent some internal events (mlme) */
		if (params->IsMcpsConfirm != 0)
		{
			if(params->AppData.Port != 0){
				BSP_LED_On(LED_GREEN) ;
				UTIL_TIMER_Start(&TxLedTimer);

				APP_LOG(0, 1, "- Payload     ");

				if(AppData.BufferSize>0)
				{
					if(USMB_VALVE){
						APP_LOG(0, 1, "Setpoint: %.1f °C | Temperature: %.1f °C", ((float) txBUFFER[0])/2, ((float) txBUFFER[1])/2);
					}
					else if(ATIM_THAQ){
						APP_LOG(0, 1, "Temperature: %.2f °C", ((float) (txBUFFER[6]<<8) + (float) txBUFFER[7])/100.0);
					}
					else if(WATTECO_TEMPO){ // Simply print the buffer
						for(int i=0;i<size_txBUFFER;i++){
							APP_LOG(0, 1, "%02X ", txBUFFER[i]);
						}
					}
					else if(TCT_EGREEN){
						APP_LOG(0, 1, "Courant: %.2f A | Voltage: %03u mV", ((float) (txBUFFER[5]<<8) + (float) txBUFFER[6])/100.0, 
																			(txBUFFER[8]<<8) + txBUFFER[9]);
					}
					else{
						for(int i=0;i<size_txBUFFER;i++){
							APP_LOG(0, 1, "%02X ", txBUFFER[i]);
						}
						APP_LOG(0, 1, "(hex)  |  ");

						for(int i=0;i<size_txBUFFER;i++){
							APP_LOG(0, 1, "%03u ", txBUFFER[i]);
						}
						APP_LOG(0, 1, "(dec)");
					}
				}


				APP_LOG(TS_OFF, VLEVEL_L, "\r\n");
				APP_LOG(TS_OFF, VLEVEL_L, "- Port        %d \r\n",params->AppData.Port);
				APP_LOG(TS_OFF, VLEVEL_L, "- Fcnt        %d \r\n",params->UplinkCounter);
				APP_LOG(TS_OFF, VLEVEL_L, "- Data Rate   %d",params->Datarate);
				switch(params->Datarate)
				{
				case 5 : APP_LOG(TS_OFF, VLEVEL_L, " (SF7)\r\n");break;
				case 4 : APP_LOG(TS_OFF, VLEVEL_L, " (SF8)\r\n");break;
				case 3 : APP_LOG(TS_OFF, VLEVEL_L, " (SF9)\r\n");break;
				case 2 : APP_LOG(TS_OFF, VLEVEL_L, " (SF10)\r\n");break;
				case 1 : APP_LOG(TS_OFF, VLEVEL_L, " (SF11)\r\n");break;
				case 0 : APP_LOG(TS_OFF, VLEVEL_L, " (SF12)\r\n");break;
				}

			}
			else{
				APP_LOG(TS_OFF, VLEVEL_L, "- Fcnt        %d \r\n",params->UplinkCounter);
			}
		}
	}
}


static void OnRxData(LmHandlerAppData_t *appData, LmHandlerRxParams_t *params)
{
	static const char *slotStrings[] = { "1", "2", "C", "C Multicast", "B Ping-Slot", "B Multicast Ping-Slot" };

	if ((appData != NULL) || (params != NULL))
	{
		if( appData->Port == 0){
			// if port==0, it is join accept or MAC command
			//APP_LOG(TS_OFF, VLEVEL_L, "MAC Command RECEIVED\r\n");
		}
		else{
			BSP_LED_On(LED_BLUE) ;
			UTIL_TIMER_Start(&RxLedTimer);
			APP_LOG_COLOR(BOLDBLUE);
			if (isRxConfirmed == 1){
				APP_LOG(TS_ON, VLEVEL_L, " Receiving Confirmed Data Down.\r\n");
			}
			else{
				APP_LOG(TS_ON, VLEVEL_L, " Receiving Unconfirmed Data Down.\r\n");
			}

			APP_LOG_COLOR(BLUE);
			APP_LOG(TS_OFF, VLEVEL_L, "- Payload     ");

			if(appData->BufferSize>0)
			{
				for(int i=0 ; i<appData->BufferSize ; i++){
					APP_LOG(0, 1, "%02X ", appData->Buffer[i]);
				}
				APP_LOG(0, 1, "(hex) ");
			}

			APP_LOG(TS_OFF, VLEVEL_L, "\r\n");
			APP_LOG(TS_OFF, VLEVEL_L, "- Port        %d \r\n",appData->Port);
			APP_LOG(TS_OFF, VLEVEL_L, "- Slot        RX%s \r\n",slotStrings[params->RxSlot]);
			APP_LOG(TS_OFF, VLEVEL_L, "- Data Rate   %d \r\n",params->Datarate);
			APP_LOG(TS_OFF, VLEVEL_L, "- RSSI        %d dBm\r\n",params->Rssi);
			APP_LOG(TS_OFF, VLEVEL_L, "- SNR         %d dB\r\n",params->Snr);
			APP_LOG_COLOR(RESET_COLOR);
		}

		switch (appData->Port)
		{
		case LORAWAN_SWITCH_CLASS_PORT:
			if (appData->BufferSize == 1)
			{
				APP_LOG_COLOR(GREEN);
				switch (appData->Buffer[0])
				{
				case 0: LmHandlerRequestClass(CLASS_A); APP_LOG(TS_OFF, VLEVEL_L, "Switch to class A\r\n"); break;
				case 1: LmHandlerRequestClass(CLASS_B); APP_LOG(TS_OFF, VLEVEL_L, "Switch to class B\r\n"); break;
				case 2: LmHandlerRequestClass(CLASS_C); APP_LOG(TS_OFF, VLEVEL_L, "Switch to class C\r\n"); break;
				default: 								break;
				}
				APP_LOG_COLOR(RESET_COLOR);
			}
			break;

		case LORAWAN_USER_APP_PORT:
			if (appData->BufferSize == 1)
			{
				APP_LOG_COLOR(GREEN);
				AppLedStateOn = appData->Buffer[0] & 0x01;
				if (AppLedStateOn == RESET)
				{
					APP_LOG(TS_OFF, VLEVEL_L, "LED 3 (RED) goes OFF\r\n");
					BSP_LED_Off(LED_RED) ;
				}
				else
				{
					APP_LOG(TS_OFF, VLEVEL_L, "LED 3 (RED) goes ON\r\n");
					BSP_LED_On(LED_RED) ;
				}
				APP_LOG_COLOR(RESET_COLOR);
			}
			break;

		case VALVE_APP_PORT:
			if (appData->BufferSize == 1)
			{
				APP_LOG_COLOR(GREEN);
				sensor_data.setpoint = appData->Buffer[0];
				APP_LOG(TS_OFF, VLEVEL_L, "New setpoint is set to %.1f °C\r\n", (float) sensor_data.setpoint/2);
				APP_LOG_COLOR(RESET_COLOR);
			}
			break;

		default:  break;
		}

