SylvainMontagny/STM32WL/STM32WL-standalone/LoRaWAN/App/lora_app.c
	}
}
static void OnJoinRequest(LmHandlerJoinParams_t *joinParams)
{
	if (joinParams != NULL)
	{
		if (joinParams->Status == LORAMAC_HANDLER_SUCCESS)
		{
			UTIL_TIMER_Stop(&JoinLedTimer);
			BSP_LED_Off(LED_RED) ;

			APP_LOG_COLOR(GREEN);
			if (joinParams->Mode == ACTIVATION_TYPE_ABP)
			{
				APP_LOG(TS_OFF, VLEVEL_L, "\r\n> ABP Activation mode\r\n");
			}
			else
			{
				APP_LOG(TS_OFF, VLEVEL_L, "\r\n> JOINED = OTAA !\r\n");
			}


			if(SEND_BY_PUSH_BUTTON == true){
				APP_LOG(0, 1, "> Packets will be sent on a Push Button event (B1) \r\n");
			}
			else{
				APP_LOG(0, 1, "> Packets will be sent every %d ms OR on a Push Button event (B1) \r\n", ADMIN_TxDutyCycleTime);
			}

			APP_LOG_COLOR(RESET_COLOR);

			/* Create TIMER for sending next Tx Frame  */
			// if (EventType == TX_ON_TIMER)
			/*  if (SEND_BY_PUSH_BUTTON == true)
       {
    	 BSP_PB_Init(BUTTON_SW1, BUTTON_MODE_EXTI);		// BUTTON_SW1 = PA0, IRQ number = EXTI0_IRQn

       }*/
			/* Send every time button is pushed */
			if (SEND_BY_PUSH_BUTTON == false)
			{
				UTIL_TIMER_Create(&TxTimer,  0xFFFFFFFFU, UTIL_TIMER_ONESHOT, OnTxTimerEvent, NULL);
				UTIL_TIMER_SetPeriod(&TxTimer,  APP_TX_DUTYCYCLE);
				UTIL_TIMER_Start(&TxTimer);
			}

			// Send a first frame just after the Join (When using timer event to send packets)
			if(SEND_BY_PUSH_BUTTON == false){
				SendTxData();
			}


		}
		else
		{
			APP_LOG_COLOR(RED);
			APP_LOG(TS_OFF, VLEVEL_L, "\r\n> JOIN FAILED ...\r\n");
			LmHandlerJoin(ActivationType);
			APP_LOG_COLOR(RESET_COLOR);
			APP_LOG(0, 1, " \r\n");
		}

	}
}

static void OnMacProcessNotify(void)
{

	UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_LmHandlerProcess), CFG_SEQ_Prio_0);

}


static void OnTxTimerEvent(void *context)
{
	UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_LoRaSendOnTxTimerOrButtonEvent), CFG_SEQ_Prio_0);

	/*Wait for next tx slot*/
	UTIL_TIMER_Start(&TxTimer);
}

static void OnTxTimerLedEvent(void *context)
{
	BSP_LED_Off(LED_GREEN) ;
}

static void OnRxTimerLedEvent(void *context)
{
	BSP_LED_Off(LED_BLUE) ;
}

static void OnJoinTimerLedEvent(void *context)
{
	BSP_LED_Toggle(LED_RED) ;
}

